frontend/controllers/SiteController.php

    public function actionArtistBio($artist_id)
    {

        if(!isset($artist_id)) return;
        if (Yii::$app->user->isGuest) {
            return $this->redirect('../user/login');
        }
        $artist = [];
        $contents = [];
        $userid = Yii::$app->user->identity->id ? Yii::$app->user->identity->id : 0;

        $artist['user'] = $this->finder->findUserById($artist_id)->getAttributes();
        $profile = $this->finder->findProfileById($artist_id);
            if(NULL != $profile) {
                $artist['profile'] = $this->finder->findProfileById($artist_id)->getAttributes();
            } else {
                $artist['profile'] = [];
            }
        $helpers = new Helpers;
        $country = $helpers->getCountries();
        $city = $helpers->getCities();

        $albums = Albums::find()->where(['created_user' => $artist_id, 'active' => 1])->with('aImages')->orderBy('id DESC')->limit(18)->all();

        $follow = Follow::find()->where(['source_id' => $artist_id, 'created_user' => $userid, 'type' => 'artist'])->orderBy('id DESC')->one();
        $follow_number = Counter::find()->where(['source_id' => $artist_id, 'type' => 'follow'])->one();

        $like = Likes::find()->where(['source_id' => $artist_id, 'created_user' => $userid, 'type' => 'artist'])->orderBy('id DESC')->one();
        $like_number = Counter::find()->where(['source_id' => $artist_id, 'type' => 'like', 'cate' => 'artist'])->one();

        $artist_bio = User::find()->where(['id' => $artist_id])->with('userProfile', 'userPhoto')->one();
---
SELECT * FROM `user` WHERE `id`='14'

    public function actionMessage()
    {
        //$userid = Yii::$app->user->identity->id ? Yii::$app->user->identity->id : 0;

        $sender = new MessageManager;
        $messageList = $sender->myMessageList();
        //$news = $sender->newMessageCount();
        //$receive = $sender->receive();

        if (isset($messageList['list']) && count($messageList['list']) >0) {
            foreach ($messageList['list'] as $key => $value) {
                $messageList['list'][$key]['user'] = User::find()->where(['id' => $value['producer']])->with('userProfile', 'userPhoto')->one();
---
SELECT * FROM `user` WHERE `id`='14'