frontend/models/CountryQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `country` WHERE location_type= 0