frontend/models/LanguageQuery.php

SELECT * FROM `language`
---
    public function all($db = null)
    {
        return parent::all($db);